# Lists:

Write a Python program to create a list of your favorite fruits and print the list.

In [3]:
Fruits=['Mango','Banana','Grapes','Orange']

In [5]:
Fruits

['Mango', 'Banana', 'Grapes', 'Orange']

Write a Python function that takes a list of numbers and returns a new list with each number squared.

In [21]:
def square_numbers(numbers):
    squared_numbers = []  # Step 2
    for num in numbers:  # Step 3
        squared_numbers.append(num**2)  # Step 4
    return squared_numbers  # Step 5

# Example usage
numbers = [1, 2, 3, 4, 5]
squared = square_numbers(numbers)
print(squared)

[1, 4, 9, 16, 25]

How would you remove the third item from a list in Python? Write the code to demonstrate this.

In [25]:
my_list=[2,4,6,8,10]

In [27]:
my_list

[2, 4, 6, 8, 10]

In [33]:
my_list.remove(6)

In [35]:
my_list

[2, 4, 8, 10]

In [39]:
def squered_numbers(numbers):
    squered_numbers = []
    for num in numbers:
        squered_numbers.append(num**2)
    return squered_numbers

numbers=[1,2,3,4]
squered=squered_numbers(numbers)
print(squered)

[1, 4, 9, 16]

# DICTIONARY

Create a dictionary to store the names and ages of three people. Write a program to print out each personâ€™s name and age.

In [54]:
my_dict={ "Name":['mercy','Ben','Timothy'],
         "Age":[21,20,19]
        }

In [60]:
my_dict

{'Name': ['mercy', 'Ben', 'Timothy'], 'Age': [21, 20, 19]}

In [66]:
df=pd.DataFrame(my_dict)

In [64]:
import pandas as pd

In [68]:
df

      Name  Age
0    mercy   21
1      Ben   20
2  Timothy   19

Write a Python function that takes a dictionary and returns a list of all the keys in the dictionary.

In [77]:
def dict_keys(dictionary):
    return list(dictionary.keys())
my_dict = {'name': 'John', 'age': 30, 'city': 'New York'}
keys_list= dict_keys(my_dict)
print (keys_list)

['name', 'age', 'city']

How can you update the value associated with a key in a dictionary? Write a code example.

In [99]:
#for question 1 in dictionary
df["Age"]=df["Age"]+1

In [101]:
df

      Name  Age
0    mercy   22
1      Ben   21
2  Timothy   20

In [103]:
df

      Name  Age
0    mercy   22
1      Ben   21
2  Timothy   20

In [109]:
my_dict['Name']='John','Mary','Berry'

In [111]:
df

      Name  Age
0    mercy   22
1      Ben   21
2  Timothy   20

In [113]:
my_dict

{'name': 'John',
 'age': 30,
 'city': 'New York',
 'Name': ('John', 'Mary', 'Berry')}

Using the Pandas library, create a DataFrame from a dictionary where the keys are column names and the values are lists of column data.

In [115]:
import pandas as pd

In [117]:
my_dict={ "Name":['mercy','Ben','Timothy'],
         "Age":[21,20,19]
        }

In [119]:
df=pd.DataFrame(my_dict)

In [121]:
df

      Name  Age
0    mercy   21
1      Ben   20
2  Timothy   19

Write a program to add a new column to an existing DataFrame with data derived from the values in another column.

In [129]:
df['location']=['Nakuru','Kericho','Kisii']

In [133]:
my_dict

{'Name': ['mercy', 'Ben', 'Timothy'],
 'Age': [21, 20, 19],
 'location': ['Nakuru', 'Kericho', 'Kisii']}

In [131]:
df

      Name  Age location
0    mercy   21   Nakuru
1      Ben   20  Kericho
2  Timothy   19    Kisii

Demonstrate how to select a specific row and column in a DataFrame using both label-based and integer-based indexing.

In [135]:
selected=df['Name']

In [137]:
selected

0      mercy
1        Ben
2    Timothy
Name: Name, dtype: object

In [143]:
df.iloc[0:2]

    Name  Age location
0  mercy   21   Nakuru
1    Ben   20  Kericho

# Data Manipulation with Pandas
Basic Operations:

Write a Python program to load a CSV file into a DataFrame and display the first five rows.

In [153]:
filepath='DataFile1/car_sales.csv'
fd=pd.read_csv(filepath)

In [159]:
fd.head()

  Manufacturer    Model  Year   Sales  Revenue
0       Toyota  Corolla  2021  1500.0  50000.0
1       Toyota    Camry  2022  2000.0  70000.0
2        Honda    Civic  2022  1800.0  60000.0
3        Honda   Accord  2021  1700.0  65000.0
4         Ford  Mustang  2023  2200.0      NaN

How would you filter rows in a DataFrame based on a condition (e.g., select rows where the value in column 'Revenue' is greater than 65000)? Provide the code.

In [167]:
filtered = fd[fd['Revenue'] > 65000]

In [169]:
filtered

   Manufacturer      Model  Year   Sales  Revenue
1        Toyota      Camry  2022  2000.0  70000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023     NaN  85000.0
12        Honda       CR-V  2023  2200.0  75000.0
14         Ford   Explorer  2022  2000.0  70000.0
15         Ford     Escape  2023  2100.0  75000.0
17    Chevrolet      Tahoe  2022  2200.0  80000.0
18       Nissan      Rogue  2023  2300.0  85000.0
20         Ford     Escape  2023  2100.0  75000.0
22    Chevrolet      Tahoe  2022  2200.0  80000.0
23       Nissan      Rogue  2023  2300.0  85000.0

# Data Transformation:

Demonstrate how to rename columns in a DataFrame.

In [182]:
fd_renamed = fd.rename(columns={'Manufacturer': 'Makers'})

In [184]:
fd_renamed

       Makers      Model  Year   Sales  Revenue
0      Toyota    Corolla  2021  1500.0  50000.0
1      Toyota      Camry  2022  2000.0  70000.0
2       Honda      Civic  2022  1800.0  60000.0
3       Honda     Accord  2021  1700.0  65000.0
4        Ford    Mustang  2023  2200.0      NaN
5        Ford     Fusion  2021  1600.0  55000.0
6   Chevrolet  Silverado  2022  1900.0  75000.0
7         NaN     Malibu  2021  1400.0  50000.0
8      Nissan     Altima  2022  2100.0  70000.0
9      Nissan     Sentra  2023     NaN  85000.0
10     Toyota      Prius  2021  1600.0  60000.0
11     Toyota       RAV4  2022  1900.0  65000.0
12      Honda       CR-V  2023  2200.0  75000.0
13      Honda      Pilot  2021  1500.0  55000.0
14       Ford   Explorer  2022  2000.0  70000.0
15       Ford     Escape  2023  2100.0  75000.0
16  Chevrolet    Equinox  2021  1700.0  60000.0
17  Chevrolet      Tahoe  2022  2200.0  80000.0
18     Nissan      Rogue  2023  2300.0  85000.0
19     Nissan     Murano  2021  1800.0  65000.0
20       Ford     Escape  2023  2100.0  75000.0
21  Chevrolet    Equinox  2021  1700.0  60000.0
22  Chevrolet      Tahoe  2022  2200.0  80000.0
23     Nissan      Rogue  2023  2300.0  85000.0
24     Nissan     Murano  2021  1800.0  65000.0

Write a program to group data in a DataFrame by a specific column and calculate the mean of each group.

In [186]:
grouped_fd = fd.groupby('Revenue')['Sales'].mean()

In [188]:
grouped_fd

Revenue
50000.0    1450.000000
55000.0    1550.000000
60000.0    1700.000000
65000.0    1800.000000
70000.0    2033.333333
75000.0    2075.000000
80000.0    2200.000000
85000.0    2300.000000
Name: Sales, dtype: float64

# Merging and Joining:

Write a program to merge two DataFrames on a common column.

In [191]:
import pandas as pd

# Creating the first sample DataFrame
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
}

df1 = pd.DataFrame(data1)

# Creating the second sample DataFrame
data2 = {
    'ID': [3, 4, 5, 6],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 90000, 100000]
}

df2 = pd.DataFrame(data2)

# Displaying the original DataFrames
print("DataFrame 1:")
print(df1)

print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

DataFrame 2:
   ID         City  Salary
0   3     New York   70000
1   4  Los Angeles   80000
2   5      Chicago   90000
3   6      Houston  100000

In [193]:
# Merging the two DataFrames on the 'ID' column
merged_df = pd.merge(df1, df2, on='ID', how='inner')

# Displaying the merged DataFrame
print("\nMerged DataFrame (inner join):")
print(merged_df)

Merged DataFrame (inner join):
   ID     Name  Age         City  Salary
0   3  Charlie   35     New York   70000
1   4    David   40  Los Angeles   80000

Demonstrate how to perform a left join on two DataFrames.

In [195]:
# Performing a left join on the 'ID' column
left_join_df = pd.merge(df1, df2, on='ID', how='left')

# Displaying the DataFrame after the left join
print("\nLeft Join DataFrame:")
print(left_join_df)

Left Join DataFrame:
   ID     Name  Age         City   Salary
0   1    Alice   25          NaN      NaN
1   2      Bob   30          NaN      NaN
2   3  Charlie   35     New York  70000.0
3   4    David   40  Los Angeles  80000.0